alexandercote/FreeRTOS_Traffic_Light_System/STM32F4_Discovery_FreeRTOS_Traffic_Light_Project/src/main.c
	return 0;
}
/*-----------------------------------------------------------*/

// Traffic light questions

/*  Traffic flow adjustment task: The traffic flow that enters the intersection is set
	by a potentiometer. This task reads the value of the potentiometer at proper
	intervals. The low resistance of the potentiometer corresponds to light traffic and
	a high resistance corresponds to heavy traffic. The reading by this task is sent
	and used by other tasks.
 */
void TrafficFlowAdjustmentTask ( void *pvParameters )
{
    uint16_t adc_value;
    uint16_t speed_adc_value;
    uint16_t current_speed_value = 0;
	while(1)
	{
		ADC_SoftwareStartConv(ADC1);
		// wait for ADC to finish conversion
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
		// grab ADC value
		adc_value = ADC_GetConversionValue(ADC1);
        speed_adc_value = adc_value/512;

        if(speed_adc_value == 8)
        {
        	speed_adc_value = 7;
        }
        
	    if(current_speed_value !=  speed_adc_value) // will only do queue stuff if the speed changed.
	    { // speed changed, changed value on queue

	    	xQueueReset( xQueue_handle_speed_creator ); // empty the queue, push new speed value onto the queue
	    	xQueueReset( xQueue_handle_light_colour );  // empty the queue, push new speed value onto the queue

	    	printf("TrafficFlowAdjustmentTask: ADC Value: %d. Adding %d to queue\n", adc_value, speed_adc_value);

			if( xQueueSend(xQueue_handle_speed_creator, &speed_adc_value, 500))
			{
				printf("TrafficFlowAdjustmentTask: adc_value sent on xQueue_handle_speed_creator queue.\n");
			}
			else
			{
				printf("TrafficFlowAdjustmentTask: Failed to send data on queue from TFA to TC tasks.\n");
			}

			if( xQueueSend(xQueue_handle_speed_light, &speed_adc_value, 500))
			{
				printf("TrafficFlowAdjustmentTask: adc_value sent on xQueue_handle_speed_light queue.\n");
			}
			else
			{
				printf("TrafficFlowAdjustmentTask: Failed to send data on queue from TFA to TL tasks.\n");
			}

	    }

        vTaskDelay(100);
        
	}
} // end Traffic_Flow_Adjustment_Task

/*  Traffic creator task: This task generates random traffic with a rate that is
	based on the potentiometer value reading. This value is received from the traffic
	flow adjustment task. The created traffic is sent to the task that displays the flow
	of the cars on the road.
 */

void TrafficCreatorTask ( void *pvParameters )
{
	//get value from traffic flow adjustment
	uint16_t received;
	// value of bit to send to display (1 or 0)
	bool send;

	while(1)
		{
			if(xQueueReceive(xQueue_handle_speed_creator, &received, 10))
			{
				xQueueSend(xQueue_handle_speed_creator, &received, 10);
				// print the received value to console
				printf("TrafficCreatorTask: The Traffic Creator Task received the value %u. \n", received );

				/* compute the value for the display (0/1)
				received should be a value 1-8
				*/
				bool TrueFalse = (rand() % 100 ) < 100/(8 - received);
				//if( TrueFalse == true){
				//	send = 1;
				//}
				//else{
				//	send = 0;
				//}
				send = TrueFalse;
				// send the display value to the display queue
				if(xQueueSend(xQueue_handle_display_traffic, &send, 10))
				{
					printf("TrafficCreatorTask: The Traffic Creator Task is sending the value %d. \n", send);
				}
				else
				{
					printf("TrafficCreatorTask: error Nothing to send\n");
				}

			}
			else
			{
				printf("TrafficCreatorTask: Nothing in the Speed Queue");
			}
			vTaskDelay(500);
		}
} // end Traffic_Creator_Task

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficDisplayTask ( void *pvParameters )
{
	//get value from traffic creator
	bool car_value = 0;
	bool light_value;
    uint32_t currentactiveprelighttraffic[8]; // 0 is newest element, 7 is at the traffic light
    uint32_t newactiveprelighttraffic[8];

	while(1)
		{
			if(xQueueReceive(xQueue_handle_display_traffic, &car_value, 10) && xQueueReceive(xQueue_handle_light_colour, &light_value, 10) && xQueueReceive(xQueue_handle_prelight_active_traffic, &currentactiveprelighttraffic, 10))
			{
				printf("TrafficDisplayTask: The Traffic Display Task received the value %u. \n", car_value ); // print the received value to console
				xQueueSend(xQueue_handle_display_traffic, &car_value, 10);
				xQueueSend(xQueue_handle_light_colour, &light_value, 10); // put back the current light value for future use
				newactiveprelighttraffic[0] = car_value;

				if(light_value == 1){                                                        // light is green, shift values normally
					printf("TrafficDisplayTask: Light is green, shifting normally. \n ");
					ShiftRegisterValuePreLight(car_value);
					ShiftRegisterValuePostLight(currentactiveprelighttraffic[7]);
					for (int i = 1; i++; i = 8)
						{
						newactiveprelighttraffic[i] = currentactiveprelighttraffic[i-1];
						}
					}

				else {                                                                        // light is red
					printf("TrafficDisplayTask: Light is red, doing fast shift. \n ");

					// need to account for new value, and not push off cars
					int shiftcounter = 0;
				    for (int i = 7; i--; i = 1)
				        {
                        if(currentactiveprelighttraffic[i] == 1)
                        {
                        	newactiveprelighttraffic[i] == 1;
                        }
                        else // value is 0, so push new value.
                        {
                        	newactiveprelighttraffic[i] = currentactiveprelighttraffic[i-1]; // grab the next value
                        	i--; // dont want to grab the next value twice, so decrement twice
                        }

                        }
					}

					ShiftRegisterValuePostLight(0); //nothing go threw traffic light, so no car.

				} // end light value else



				xQueueSend(xQueue_handle_prelight_active_traffic, &newactiveprelighttraffic, 10);


				vTaskDelay(500);
			}
}


 // end Traffic_Display_Task




static void vGreenLightTimerCallback( xTimerHandle xTimer )
{
	// green light time is up, change the light to red
	// set some flag or something for the display controller
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);        // turn off green light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);         // turn on yellow light
	printf("GreenLightTimer: Green Light Off, Yellow light on. \n");
	xTimerStart( xYellowLightSoftwareTimer, 0 );
}
static void vYellowLightTimerCallback( xTimerHandle xTimer )
	{
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);       // turn off yellow light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);            // turn on red light
	xQueueReset( xQueue_handle_light_colour );                          // wipe the current light value on the queue
	bool lightcolour = 0;                                               // 1 = green, 0 = red
	xQueueSend(xQueue_handle_light_colour, &lightcolour, 10);           // send the new light colour to the queue
	printf("YellowLightTimer: Yellow light off, red light on. lightcolour = %d was sent to queue. \n", lightcolour);
	xTimerStart( xRedLightSoftwareTimer, 0 );
}
static void vRedLightTimerCallback( xTimerHandle xTimer )
{
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);          // turn off red light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);          // turn on green light
	xQueueReset( xQueue_handle_light_colour );                          // wipe the current light value on the queue
	bool lightcolour = 1;                                               // 1 = green, 0 = red
	xQueueSend(xQueue_handle_light_colour, &lightcolour, 10);           // send the new light colour to the queue
	printf("RedLightTimer: Red light off, green light on. lightcolour = %d was sent to queue. \n", lightcolour);
	xTimerStart( xGreenLightSoftwareTimer, 0 );
}

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficLightTask ( void *pvParameters )
{
	// get speed
	// given speed, change timing

